cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

brew 'ack'
brew 'awscli'
brew 'cmake'
brew 'coreutils' # GNU core utilities (those that come with macOS are outdated)
brew 'jq'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'libyaml'
brew 'node'
brew 'openssl'
brew 'reattach-to-user-namespace' #tmux https://evertpot.com/osx-tmux-vim-copy-paste-clipboard/
#brew 'the_silver_searcher' # Like ack but much faster. I use it in vim ctrlp
#brew 'tmux'
brew 'vim', args: ['--override-system-vi']
brew 'wget'
brew 'zsh'

#cask 'docker'
#cask 'docker-toolbox'
cask 'dropbox'
cask 'google-chrome'
cask 'iterm2'
cask 'lastpass'
#cask 'phpstorm'
cask 'sequel-pro'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
#cask 'vlc'
